# encoding: utf-8
# language: ru


Функционал: Прототипирование задачи в виде прототипа интерфейса самим заказчиком
	Как заказчик продукту или проекта
	Я хочу быстро спроектировать будущий интерфейс рабочего стола определенной роли
	И передать прототип на первичный анализ в команду 1С специалистов
	
Контекст:
	Дано СистемаУправленияТребованиями
	И я имею доступ на создание в ней запросов
	
Сценарий: Создание наброска интерфейса
	Дано Существует 1С информационная система
	Когда я начинаю создавать набросок интерфейса
	Тогда я тогда я открываю обработку ".\vendors\vanessa-mockup"
	И после  создания наброска создаю запрос в СистемаУправленияТребованиями с прикрепленным наброском
