# encoding: utf-8
# language: ru

Р¤СѓРЅРєС†РёРѕРЅР°Р»: РЎР±РѕСЂ С‚СЂРµР±РѕРІР°РЅРёР№ РґР»СЏ СЂР°Р·СЂР°Р±РѕС‚РєРё РЅР° 1РЎ
	Как человек решивший взять на себе в проекте роль системного аналитика
	РЇ С…РѕС‡Сѓ С‡С‚РѕР±С‹ С‚СЂРµР±РѕРІР°РЅРёСЏ Р±С‹Р»Рё СЃС„РѕСЂРјСѓР»РёСЂРѕРІР°РЅС‹ СЃС‚СЂСѓРєС‚СѓСЂРёСЂРѕРІР°РЅРѕ
	Р С…РѕС‡Сѓ С‡С‚РѕР±С‹ С‚СЂРµР±РѕРІР°РЅРёСЏ Р±С‹Р»Рё РїРѕРЅСЏС‚РЅС‹ РІСЃРµРј СѓС‡Р°СЃС‚РЅРёРєР°Рј РїСЂРѕРµРєС‚Р°, РІРєР»СЋС‡Р°СЏ Р·Р°РєР°Р·С‡РёРєР°

РљРѕРЅС‚РµРєСЃС‚:
	Когда Существует <СистемаУправленияТребованиями>
	Р РІ РЅРµР№ Р·Р°С„РёРєСЃРёСЂРѕРІР°РЅС‹ Р·Р°РїСЂРѕСЃС‹ РѕС‚ РїРѕР»СЊР·РѕРІР°С‚РµР»РµР№
	Р РІ РЅРµР№ Р·Р°С„РёРєСЃРёСЂРѕРІР°РЅС‹ РјРѕРё Р·Р°РјРµС‚РєРё

РЎС‚СЂСѓРєС‚СѓСЂР° СЃС†РµРЅР°СЂРёСЏ: РћР±СЂР°Р±РѕС‚РєР° С‚СЂРµР±РѕРІР°РЅРёР№ РёР· СЃРёСЃС‚РµРј СѓРїСЂР°РІР»РµРЅРёСЏ С‚СЂРµР±РѕРІР°РЅРёСЏРјРё
	Р”Р°РЅРѕ РЎСѓС‰РµСЃС‚РІСѓРµС‚ <РЎРёСЃС‚РµРјР°РЈРїСЂР°РІР»РµРЅРёСЏРўСЂРµР±РѕРІР°РЅРёСЏРјРё>
	Дано Существует <СистемаУправленияТребованиями>
	РўРѕРіРґР° СЏ РѕС‚РєСЂС‹РІР°СЋ РѕР±СЂР°Р±РѕС‚РєСѓ ".\vendors\vanessa-bdd-editor"
	Р С„РѕСЂРјСѓР»РёСЂСѓСЋ С‚СЂРµР±РѕРІР°РЅРёСЏ РЅР° СЏР·С‹РєРµ Gherkin
	Р РїРѕСЃР»Рµ СЃРѕС…СЂР°РЅРµРЅРёСЏ РїРѕРјРµС‰Р°СЋ РёР·РјРµРЅРµРЅРёСЏ РІ git c РїРѕРјРѕС‰СЊСЋ <РўСЌРіРЎРІСЏР·Рё> СЃ <Р—Р°РїСЂРѕСЃ>

 РџСЂРёРјРµСЂС‹:
        | РЎРёСЃС‚РµРјР°РЈРїСЂР°РІР»РµРЅРёСЏРўСЂРµР±РѕРІР°РЅРёСЏРјРё  |   Р—Р°РїСЂРѕСЃ      | РўСЌРіРЎРІСЏР·Рё |
        | http://redmine.org             |    Issue      |    #     |
        | http://jira.com                |    Request    |    #     |
	    	| https://github.com             |    Issue      |    #     |
  		  | https://bitbucket.com          |    Issue      |    #     |
