Функционал: Старт работы над продуктом
  Для того чтобы создать продукт в срок и иметь возможность его развивать
  Как лидер продукта
  Я хочу стартовать работу над продуктом правильно сразу, а не потом

Необходимо отказаться от терминологии проект
--------------

дело в том, что проект - это некая деятельность имеющая начало и конец
а продукт - это то что рождается, живет и умирает. Поэтому продукт не может умереть когда передан закачику - значит проект для заказчика, не может быть проектом - он именно продукт.

Если Вы с этим не согласны - дальшейшее чтение стоит отменить до лучших времен

Контекст:
  Дано я больше не употребляю слово проект, заменив его на продукт
  И я теперь называю проектом собраннную команду работы над продуктом











  

