
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РежимОпределенияДиректив82 = Параметры.РежимОпределенияДиректив82;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыполнить(Команда)
	
	Результат = ПропарситьМодуль();
	Если ТипЗнч(Результат) = Тип("Строка") Тогда
		Предупреждение(Результат);
	Иначе
		Закрыть(Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПропарситьМодуль()
	
	Обработка = РеквизитФормыВЗначение("Объект");
	Обработка.РежимОпределенияДиректив82 = РежимОпределенияДиректив82;
	Результат = Обработка.РазобратьТекстМодуля(ТекстМодуля);
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		Результат.Функции   = ПоместитьВоВременноеХранилище(Результат.Функции);
		Результат.Вызовы    = ПоместитьВоВременноеХранилище(Результат.Вызовы);
		Результат.Директивы = ПоместитьВоВременноеХранилище(Результат.Директивы);
		Результат.Секции    = ПоместитьВоВременноеХранилище(Результат.Секции);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

